<script lang="ts">
  import { _ } from "svelte-i18n";

  import LegalPage from "@/components/Templates/LegalPage.svelte";
  import { retailerName as retailerNameStore } from "@/stores/retailer";

  export let retailerName: string;

  $retailerNameStore = retailerName;
</script>

<LegalPage
  retailerName="{retailerName}"
  pageTitle="{$_('settings.privacyPolicy')}"
>
  <div slot="content" class="privacy-policy">
    <p>
      本政策适用于资生堂旅游零售（亚太）私人有限公司（下称“
      <strong>资生堂</strong>
      ”或“
      <strong>我们</strong>
      ”）的产品或服务。
    </p>
    <p>
      最近更新日期：<span class="helvetica-neue">2022</span>年<span
        class="helvetica-neue">3</span
      >月<span class="helvetica-neue">28</span>日。
    </p>
    <p>
      <strong>引言</strong>
    </p>
    <p>
      我们非常重视您的隐私和个人信息保护，因此特制定本隐私政策（下称“
      <strong>本政策</strong>
      ”），以帮助您充分了解您在使用我们产品和服务的过程中，我们会如何收集、存储、使用、传输、提供和保护您的个人信息。
    </p>
    <p>
      本政策适用于我们所收集的个人信息
      ，包括但不限于我们通过官方网站、在线商城、线下柜台、微信公众号、微信小程序等途径收集的个人信息。
    </p>
    <p>
      在使用我们的产品与服务之前，请您务必仔细阅读和理解本政策，特别应重点阅读我们以
      <strong>粗体/粗体下划线</strong>
      标识的条款，确保您充分理解和同意之后再开始使用。
      <strong>
        如您选择使用或在我们更新本政策后（我们会及时提示您更新的情况）继续使用我们的产品与服务，即表示您已充分理解、同意本政策（含更新版本）的全部内容，并同意我们根据本政策收集、存储、使用、传输、提供和保护您的个人信息。若您不同意本政策或其中任何一部分内容，请立即停止使用我们的产品与服务。
      </strong>
    </p>
    <p>
      如对本政策内容有任何疑问、意见或建议，您可通过以下联系方式与我们联系：
    </p>
    <p>
      客服邮箱：
      <a href="mailto:corporatecomm@tr.shiseido.com" class="helvetica-neue">
        corporatecomm@tr.shiseido.com
      </a>
    </p>
    <p>一般情况下，我们将在30天内回复。</p>
    <br />
    <p>本政策将帮助您了解以下内容：</p>
    <p>一. 我们如何收集和使用您的个人信息</p>
    <p>
      二. 我们如何使用
      <span class="helvetica-neue">Cookie</span>
      和同类技术
    </p>
    <p>三. 我们如何共享、转让、公开披露您的个人信息</p>
    <p>四. 我们如何保护您的个人信息</p>
    <p>五. 您的权利</p>
    <p>六. 我们如何处理未成年人的个人信息</p>
    <p>七. 您的个人信息如何存储及在全球范围转移</p>
    <p>八. 本政策如何更新</p>
    <br />
    <p class="indent-0">
      <strong>一、 我们如何收集和使用您的个人信息</strong>
    </p>
    <p class="indent-0">
      <strong>（一）您需授权我们收集和使用您的个人信息的情形</strong>
    </p>
    <p>
      在使用资生堂相关产品与服务时，您理解并同意，我们将根据下列不同场景下的相应目的收集、使用或以其他方式处理您特定种类的个人信息，以向您提供产品与服务和提升我们的产品与服务质量。
    </p>
    <p class="indent-0">
      <strong>1. 为您提供产品活动体验</strong>
    </p>
    <p class="indent-0">
      <strong>（1） 注册成为用户</strong>
    </p>
    <p>
      当您注册用户时，为完成创建账号，您可能需要提供以下信息：您的用户名、出生日期、电话号码、性别、所在城市、产品使用情况等。如果您仅使用浏览、搜索等基本服务，您不需要注册成为我们的用户及提供上述信息。
    </p>
    <p class="indent-0">
      <strong>（2） 为您查找附近的门店</strong>
    </p>
    <p>
      当您通过我们的网站、微信公众号或微信小程序查询我们的门店信息时，我们会收集并使用与您的实际位置相关的信息，如移动设备发送的
      <span class="helvetica-neue">GPS</span>
      信号。我们也会使用各类技术来进行定位，例如您的设备发散的感应数据可提供比如您附近
      <span class="helvetica-neue">Wi-Fi</span>
      接入点、近场通信
      <span class="helvetica-neue">(NFC)</span>
      和蜂窝塔等相关信息。
    </p>
    <br />
    <p class="indent-0">
      <strong>2. 开展数据分析和研究，改善我们的产品或服务</strong>
    </p>
    <p>
      为了开展数据分析和研究并改善我们向您提供的服务，当您与我们的网站、微信公众号或微信小程序互动时，我们可能收集相关信息，以及您是如何使用该等网站、微信公众号和微信小程序的。
    </p>
    <p class="indent-0">
      <strong>（1） 网站</strong>
    </p>
    <p>
      我们可能收集您浏览的各网页的相关信息，以及您是如何使用各网站的。每次您浏览我们的网站，数据会从您的浏览器发送到我们的服务器。此类信息有助优化我们的服务，提升您在我们的网站、微信公众号和微信小程序的个性化体验。此类信息具体包括：
    </p>
    <ul>
      <li>您的<span class="helvetica-neue">IP</span>地址；</li>
      <li>浏览日期和时间；</li>
      <li>
        转引<span class="helvetica-neue">URL</span
        >（即访客是从哪个网址转至我们网站的）；
      </li>
      <li>在我们的网站浏览的网页以及进行的相关操作；</li>
      <li>设备和浏览器相关信息（浏览器类型和版本、操作系统等）。</li>
    </ul>
    <p class="indent-0">
      <strong>（2） 商品展示、个性化推荐、发送促销营销信息</strong>
    </p>
    <p>
      为改善我们的产品或服务、向您提供个性化的信息搜索及交易服务，我们可能会根据您的设备信息、位置信息，提取您的浏览、搜索偏好、位置信息等特征，基于特征标签进行间接人群画像并展示、推送信息。
    </p>
    <p>
      在不透露单个用户隐私资料的前提下，我们会对整个用户数据库进行分析并对用户数据库进行商业上的利用。我们会始终致力于在充分保护您个人信息的前提下，为您提供更优质的体验和服务。
    </p>
    <p class="indent-0">
      <strong>3. 其他用途</strong>
    </p>
    <p>您的个人信息还可能被用于以下用途：</p>
    <ul>
      <li>
        改进我们的产品和提升您在我们网站、微信公众号、微信小程序、门店的用户体验；
      </li>
      <li>评估网站、微信公众号、微信小程序、产品以及服务的使用；</li>
      <li>分析我们的广告、竞赛以及促销的有效性；</li>
      <li>
        使网站、微信公众号、微信小程序、门店的使用更轻松并且更好地设计研发产品或服务，以满足您的兴趣和需求；
      </li>
      <li>
        建议我们认为您可能感兴趣的产品或服务（包括相关第三方的产品或服务）；
      </li>
      <li>向您提供参加竞赛或促销的机会；</li>
      <li>向您发送您所要求的信息、产品或样品；</li>
      <li>回复您的询问或评论。</li>
    </ul>
    <p class="indent-0">
      <strong>（二）征得授权同意的例外</strong>
    </p>
    <p>
      <strong class="is-underlined">
        您充分知晓，根据相关法律法规规定，在以下情形中，我们可能会依法收集并使用您的个人信息而无需征得您的授权同意：
      </strong>
    </p>
    <ul>
      <li>为我们履行法定职责或法定义务所必需的；</li>
      <li>为应对突发公共卫生事件所必需的；</li>
      <li>紧急情况下为保护您或其他自然人的生命健康和财产安全所必需的；</li>
      <li>
        在合理范围内收集、使用您自行向社会公众公开或其他已经合法公开的您的个人信息；
      </li>
      <li>为与您订立、履行相关协议或其他书面文件所必需的；</li>
      <li>
        为公共利益实施新闻报道、舆论监督等行为，在合理的范围内收集、使用您的个人信息；
      </li>
      <li>法律、行政法规规定的其他情形。</li>
    </ul>
    <p class="indent-0">
      <strong>
        二、 我们如何使用
        <span class="helvetica-neue">Cookie</span>
        和同类技术
      </strong>
    </p>
    <p class="indent-0">
      <strong>（一）<span class="helvetica-neue">Cookie</span></strong>
    </p>
    <p>
      我们的网站或网上商城使用<span class="helvetica-neue">Cookie</span
      >，以便您能登录我们的服务，并允许设定您特定的服务选项。运用<span
        class="helvetica-neue">Cookie</span
      >技术，网站或网上商城能够为您提供更加周到的个性化服务。您可以选择接受或拒绝<span
        class="helvetica-neue">Cookie</span
      >。您可以通过修改浏览器设置的方式拒绝<span class="helvetica-neue"
        >Cookie</span
      >。如果您选择拒绝<span class="helvetica-neue">Cookie</span
      >，则您可能无法登录或使用依赖于<span class="helvetica-neue">Cookie</span
      >的我们的网站或网上商城服务或功能。
    </p>
    <p class="indent-0">
      <strong>（二）<span class="helvetica-neue">Cookie</span>同类技术</strong>
    </p>
    <p>
      保有您的使用记录当您使用我们官方网站或网上商城提供的服务时，服务器会自动记录一些信息，包括<span
        class="helvetica-neue">URL</span
      >、<span class="helvetica-neue">IP</span
      >地址、浏览器的类型和使用的语言以及访问日期和时间等。
    </p>
    <p class="indent-0">
      <strong>三、 我们如何共享、转让、公开披露您的个人信息 </strong>
    </p>
    <p>
      除本政策披露的情况外，我们不会主动共享或转让您的个人信息至第三方，如存在其他共享或转让您的个人信息情形时，我们会征得您的明确同意。
    </p>
    <p>
      随着我们业务的持续发展，我们有可能进行合并、分立、业务/资产转让等交易，我们将告知您相关情形，按照法律法规及不低于本政策所要求的标准继续保护或要求接收方继续保护您的个人信息。
    </p>
    <p class="indent-0">
      <strong>（一）共享</strong>
    </p>
    <p>
      我们不会与本公司以外的任何公司、组织和个人分享您的个人信息，但以下情况除外：
    </p>
    <ol>
      <li>
        在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他第三方共享您的个人信息。
      </li>
      <li>
        我们可能会根据法律法规规定、诉讼、争议解决需要，或按政府主管部门的强制性要求，对外共享您的个人信息。
      </li>
      <li>
        与我们的关联公司共享：
        <strong class="is-underlined">
          基于公司业务运营和管理的需要，我们可能会与我们的关联公司共享您的个人信息，以便我们为您提供更为优质的服务。
        </strong>
        我们只会共享必要的个人信息，且受本政策中所声明目的的约束。如果我们共享您的
        <strong class="is-underlined">敏感个人信息</strong>
        或我们的关联公司改变个人信息的处理目的，我们将根据法律法规的要求再次征求您的授权同意。
      </li>
      <li>
        与服务供应商或合作伙伴共享：仅为实现本政策中声明的目的，我们聘用各类服务供应商或与合作伙伴进行合作。我们可能会与服务供应商或合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确、合理的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。
      </li>
    </ol>
    <p class="indent-0">
      <strong>（二）转让</strong>
    </p>
    <p>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</p>
    <ol>
      <li>
        在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他第三方转让您的个人信息；
      </li>
      <li>
        根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供；
      </li>
      <li>
        在涉及合并、分立、解散或破产清算时，如涉及到个人信息转让，我们会向您告知接收方的名称或姓名和联系方式，并要该接收方继续受本政策的约束，否则我们将要求该接收方重新向您征求授权同意。
      </li>
    </ol>
    <p class="indent-0">
      <strong>（三）公开披露</strong>
    </p>
    <p>我们仅会在以下情况下，公开披露您的个人信息：</p>
    <ol>
      <li>获得您明确同意；</li>
      <li>
        基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
      </li>
    </ol>
    <p>
      根据适用的法律，
      <strong class="is-underlined">
        若我们对个人信息采取技术措施和其他必要措施进行匿名化处理，确保数据接收方无法复原并重新识别个人信息主体，则此类处理后数据的共享、转让与公开披露将无需另行向您通知并征得您的同意。
      </strong>
    </p>
    <p class="indent-0">
      <strong>四、 我们如何保护您的个人信息 </strong>
    </p>
    <p>
      <strong class="is-underlined">
        我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权的访问、泄露、篡改、损坏或丢失。
      </strong>
      我们会采取一切合理可行的措施，保护您的个人信息。
    </p>
    <p>
      互联网并非绝对安全的环境，我们将尽力保障您发送给我们的任何信息的安全。电子邮件、即时通讯等交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保障您的账号安全。
    </p>
    <p>
      在不幸发生个人信息安全事件后，我们将按照适用的法律法规的要求，及时向您告知：安全事件的基本情况和可能造成的危害、我们已采取或将要采取的补救措施、您可以采取的减轻危害的措施、我们的联系方式等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
    </p>
    <p class="indent-0">
      <strong>五、 您的权利</strong>
    </p>
    <p>按照法律法规要求，我们保障您对自己的个人信息行使以下权利：</p>
    <p class="indent-0">
      <strong>（一）查阅您的个人信息</strong>
    </p>
    <p>
      您有权查阅您的个人信息，法律法规规定的例外情况除外。如果您想行使查阅权，可以通过登陆微信公众号或为微信小程序，点击相应的功能按钮自行查阅，或通过本政策文首提供的方式与我们联系。
    </p>
    <p class="indent-0">
      <strong>（二）更正、补充您的个人信息</strong>
    </p>
    <p>
      当您发现我们处理的关于您的个人信息不准确或不完整时，您可以登录微信公众号或微信小程序，点击相应的功能按钮，进行数据的更正或补充。我们将在30天内回复您的更正、补充请求。
    </p>
    <p class="indent-0">
      <strong>（三）复制、转移您的个人信息</strong>
    </p>
    <p>
      您可通过本政策文首提供的方式与我们联系，要求复制您的个人信息、或在符合法律法规规定的条件下请求转移您的个人信息至您指定的第三方。
    </p>
    <p class="indent-0">
      <strong>（四）删除您的个人信息</strong>
    </p>
    <p>
      在以下情形中，您可以通过本政策文首提供的方式与我们联系，提出删除个人信息的请求：
    </p>
    <ol>
      <li>如果我们处理个人信息的行为违反法律法规；</li>
      <li>如果我们处理个人信息的行为违反本政策；</li>
      <li>如果我们处理个人信息的行为违反与您的其他约定（如有）；</li>
      <li>如果我们停止为您提供产品或服务，或保存期限已届满；</li>
      <li>您主动注销账号或撤回对我们个人信息处理事项的同意；</li>
      <li>
        如果我们处理您个人信息的目的已经实现、无法实现或者相关个人信息对于实现处理目的不再必要；
      </li>
      <li>法律、行政法规规定的其他情形。</li>
    </ol>
    <p>
      若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
    </p>
    <p>
      <strong class="is-underlined">
        当您或我们协助您删除相关信息后，因为适用的法律和安全技术限制，我们可能无法立即从备份系统中删除相应的信息，我们将安全地存储您的个人信息并限制对其地任何进一步的处理，直到备份可以清除或实现匿名化。
      </strong>
    </p>
    <p>
      根据《中华人民共和国网络安全法》的要求，在删除您的个人信息以后，与您相关的监测、记录网络运行状态、网络安全事件日志仍将留存不少于六个月。
    </p>
    <p class="indent-0">
      <strong> （五）注销您的账户 </strong>
    </p>
    <p>
      您随时可注销此前注册的账户，在注销账户之后，我们将停止为您提供相关产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。
    </p>
    <p>
      若要注销您的账号，您可通过发送电子邮件至
      <a href="mailto:corporatecomm@tr.shiseido.com" class="helvetica-neue">
        corporatecomm@tr.shiseido.com
      </a>
      向我们提出注销账户的请求。我们将在核查完毕后注销您的账号，并删除或匿名化处理您的个人信息。
    </p>
    <p class="indent-0">
      <strong> （六）改变您授权同意的范围 </strong>
    </p>
    <p>
      您可以通过删除信息、关闭设备功能等方式改变您授权我们继续处理个人信息的范围或撤回您的授权同意。您也可以通过注销账户的方式，撤回我们继续处理您个人信息的全部授权同意。除此之外，对于我们额外收集的个人信息，就其处理行为，您可以随时给予或者收回您的授权同意。若在此过程中，您需要任何帮助，可根据本政策文首提供的方式与我们联系。
    </p>
    <p>
      请理解，每个业务功能需要一些基本的个人信息才能得以完成。当您收回同意后，我们将不再对相应的个人信息进行收集、使用等行为。这可能意味着我们将无法执行必要的操作，以达到上文所述的为您处理数据的目的，且您可能无法使用我们的产品或服务。您收回同意的决定，不会影响我们此前基于您的授权同意而开展的个人信息处理。
    </p>
    <p class="indent-0">
      <strong> （七）响应您的上述请求 </strong>
    </p>
    <p>
      为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
      我们将在30天内做出答复。
    </p>
    <p>
      对于您合理的请求，我们原则上不收取费用，
      <strong class="is-underlined">
        但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
      </strong>
    </p>
    <p>在以下情形中，按照法律法规要求，我们将无法响应您的请求：</p>
    <ol>
      <li>与我们履行法律法规规定的义务相关的；</li>
      <li>与国家安全、国防安全直接相关的；</li>
      <li>与公共安全、公共卫生、重大公共利益直接相关的；</li>
      <li>与犯罪侦查、起诉、审判和判决执行等直接相关的；</li>
      <li>有充分证据表明您存在主观恶意或滥用权利的；</li>
      <li>响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；</li>
      <li>涉及商业秘密的。</li>
    </ol>
    <p class="indent-0">
      <strong>六、我们如何处理未成年人的个人信息</strong>
    </p>
    <p>
      <strong class="is-underlined">
        请注意，我们的微信小程序、官方网站等主要针对成年人提供服务。我们不会在明知的情况下主动要求不满十八周岁的未成年人提供个人信息。
      </strong>
      如果未成年人主动向我们提供个人信息，我们将会在知悉其未成年身份后尽快将其个人信息删除或进行匿名化处理。
    </p>
    <p>
      如您是未成年人的监护人且发现您所监护的未成年人向我们提供了个人信息，您可以通过本政策文首提供的方式与我们联系，我们将协助采取相应措施。
    </p>
    <p class="indent-0">
      <strong>七、 您的个人信息如何存储及在全球范围转移</strong>
    </p>
    <p class="indent-0">
      <strong>（一）存储地点</strong>
    </p>
    <p>
      我们在中华人民共和国境内收集和产生的个人信息，将存储在中国境内。为了更好地提供服务或优化服务质量，在法律法规允许范围以及为您提供服务所必须的限度内，我们可能通过第三方机构分析、处理您的个人信息，在此过程中您的个人信息可能会被转移至中国境外进行分析、处理。在此情形下，我们会单独征得您的授权同意，根据个人信息保护相关法律法规完成跨境传输的前提条件，尽最大努力保障您的个人信息在此过程中的安全，并要求境外接收方按照不低于适用的法律法规以及本政策规定的保密和安全措施来处理这些个人信息。
    </p>
    <p class="indent-0">
      <strong>（二）存储期限</strong>
    </p>
    <p>
      我们会采取合理可行的措施，尽力避免处理无关的个人信息。
      <strong class="in-underlined">
        我们只会在实现本政策所述目的所需的期限内保留您的个人信息，除非法律法规有强制的留存要求。
      </strong>
      我们判断个人信息的存储期限主要参考以下标准并以其中较长者为准：
    </p>
    <ol>
      <li>
        完成与您相关的交易目的、维护相应交易及业务记录，以应对您可能的查询或投诉；
      </li>
      <li>保证我们为您提供服务或产品的安全和质量；</li>
      <li>您是否同意更长的留存期间；</li>
      <li>是否存在保留期限的其他特别约定。</li>
    </ol>
    <p>
      在超出保留期间后，我们会根据适用法律的要求删除您的个人信息，或对其进行匿名化处理。
    </p>
    <p class="indent-0">
      <strong>（三）其他</strong>
    </p>
    <p>
      如我们停止提供我们的产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。
    </p>
    <p class="indent-0">
      <strong>八、 本政策如何更新</strong>
    </p>
    <p>
      我们可能会适时对本政策进行修订。当本政策的条款发生变更时，我们将在变更生效前，通过在页面显著位置提示或向您发送电子邮件等方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的政策约束。
    </p>
    <p>
      对于重大变更，我们还会提供更为显著的通知（包括通过公示的方式进行通知、向您提供弹窗提示或向您发送电子邮件等），并在法律法规要求的情况下重新征得您的同意。
    </p>
    <p>本政策所指的重大变更包括但不限于：</p>
    <ol class="page-bottom">
      <li>
        我们的服务模式发生重大变化，如处理个人信息的目的、处理的个人信息类型、个人信息的处理方式等；
      </li>
      <li>
        我们在所有权结构、组织架构等方面发生重大变化，如业务调整、破产并购等引起的所有者变更等；
      </li>
      <li>个人信息共享、转让或公开披露的主要对象发生变化；</li>
      <li>您参与个人信息处理方面的权利及其行使方式发生重大变化；</li>
      <li>我们负责处理个人信息保护的责任部门、联络方式及投诉渠道发生变化。</li>
    </ol>
  </div>
</LegalPage>

<style lang="scss">
  .privacy-policy {
    overflow-y: auto;
    flex: 1;
    // max-height: 90%;

    &::-webkit-scrollbar {
      display: none;
    }

    p {
      text-indent: 2rem;

      &.indent-0 {
        text-indent: 0;
      }

      &:not(:last-child) {
        margin-bottom: 1.5rem;
      }
    }

    ol {
      list-style-type: decimal;
      padding-left: revert;
      margin-bottom: 1.5rem;

      &.page-bottom {
        margin-bottom: 5rem;
      }
    }

    ul {
      list-style-type: circle;
      padding-left: revert;
      margin-bottom: 1.5rem;
    }
  }
</style>
